# Host Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Opening..::..Host Property
Opening Class See Also
---
Retrieves the host element of this opening.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Element Host { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Host As Element
	Get
```

Visual C++
---
```text
public:
property Element^ Host {
	Element^ get ();
}
```

# See Also
Opening Class
Autodesk.Revit.DB Namespace